In [1]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
from sklearn.metrics import confusion_matrix
from sklearn import preprocessing

In [2]:
data=pd.read_csv('train.csv')

In [3]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [5]:
data["Age"].fillna("18", inplace = True)
data["Embarked"].fillna("S",inplace = True)

In [6]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

In [7]:
# Import label encoder 
from sklearn.preprocessing import LabelEncoder
encode=LabelEncoder()
data["Sex"]=encode.fit_transform(data["Sex"])
data["Embarked"]=encode.fit_transform(data["Embarked"])

# Survived is DV
# Others are IDV

In [8]:
y=data['Survived']

In [9]:
X=data.drop(['Pclass','Name', 'PassengerId','Cabin','Ticket'],axis=1)

In [10]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.30,random_state=0)

In [11]:
X_train.head()

     Survived  Sex Age  SibSp  Parch     Fare  Embarked
857         1    1  51      0      0  26.5500         2
52          1    0  49      1      0  76.7292         0
386         0    1   1      5      2  46.9000         2
124         0    1  54      0      1  77.2875         2
578         0    0  18      1      0  14.4583         0

In [12]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22,1,0,A/5 21171,7.2500,NaN,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38,1,0,PC 17599,71.2833,C85,0
2,3,1,3,"Heikkinen, Miss. Laina",0,26,0,0,STON/O2. 3101282,7.9250,NaN,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35,1,0,113803,53.1000,C123,2
4,5,0,3,"Allen, Mr. William Henry",1,35,0,0,373450,8.0500,NaN,2
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",1,27,0,0,211536,13.0000,NaN,2
887,888,1,1,"Graham, Miss. Margaret Edith",0,19,0,0,112053,30.0000,B42,2
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",0,18,1,2,W./C. 6607,23.4500,NaN,2
889,890,1,1,"Behr, Mr. Karl Howell",1,26,0,0,111369,30.0000,C148,0
890,891,0,3,"Dooley, Mr. Patrick",1,32,0,0,370376,7.7500,NaN,1

In [13]:
X_train.head()

     Survived  Sex Age  SibSp  Parch     Fare  Embarked
857         1    1  51      0      0  26.5500         2
52          1    0  49      1      0  76.7292         0
386         0    1   1      5      2  46.9000         2
124         0    1  54      0      1  77.2875         2
578         0    0  18      1      0  14.4583         0

In [14]:
X_test.head()

     Survived  Sex Age  SibSp  Parch      Fare  Embarked
495         0    1  18      0      0   14.4583         0
648         0    1  18      0      0    7.5500         2
278         0    1   7      4      1   29.1250         1
31          1    0  18      1      0  146.5208         0
255         1    0  29      0      2   15.2458         0

In [15]:
from sklearn import svm
from sklearn.svm import SVC
clf=svm.SVC(gamma=0.01,C=100)

In [16]:
clf.fit(X_train,y_train)

SVC(C=100, break_ties=False, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma=0.01, kernel='rbf',
    max_iter=-1, probability=False, random_state=None, shrinking=True,
    tol=0.001, verbose=False)

In [17]:
y_pred=clf.predict(X_test)

In [18]:
accuracy_score(y_test,y_pred,normalize=True)

0.9552238805970149

In [19]:
confusion_matrix(y_test,y_pred)

array([[166,   2],
       [ 10,  90]], dtype=int64)

# Gender is DV
# Others are IDV

In [21]:
y=data['Sex']

In [22]:
X=data.drop(['Pclass','Name', 'PassengerId','Cabin','Ticket'],axis=1)

X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.30,random_state=0)

X_train.head()
X_test.head()

     Survived  Sex Age  SibSp  Parch      Fare  Embarked
495         0    1  18      0      0   14.4583         0
648         0    1  18      0      0    7.5500         2
278         0    1   7      4      1   29.1250         1
31          1    0  18      1      0  146.5208         0
255         1    0  29      0      2   15.2458         0

In [23]:
from sklearn import svm
from sklearn.svm import SVC
clf=svm.SVC(gamma=0.01,C=100)

In [24]:
clf.fit(X_train,y_train)

SVC(C=100, break_ties=False, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma=0.01, kernel='rbf',
    max_iter=-1, probability=False, random_state=None, shrinking=True,
    tol=0.001, verbose=False)

In [25]:
y_pred=clf.predict(X_test)

In [26]:
accuracy_score(y_test,y_pred,normalize=True)

0.9402985074626866

In [27]:
confusion_matrix(y_test,y_pred)

array([[ 90,   9],
       [  7, 162]], dtype=int64)

# Embarked is DV
# Others are IDV

In [28]:
y=data['Embarked']

In [29]:
X=data.drop(['Pclass','Name', 'PassengerId','Cabin','Ticket'],axis=1)
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.30,random_state=0)

In [30]:
X_train.head()

     Survived  Sex Age  SibSp  Parch     Fare  Embarked
857         1    1  51      0      0  26.5500         2
52          1    0  49      1      0  76.7292         0
386         0    1   1      5      2  46.9000         2
124         0    1  54      0      1  77.2875         2
578         0    0  18      1      0  14.4583         0

In [31]:
X_test.head()

     Survived  Sex Age  SibSp  Parch      Fare  Embarked
495         0    1  18      0      0   14.4583         0
648         0    1  18      0      0    7.5500         2
278         0    1   7      4      1   29.1250         1
31          1    0  18      1      0  146.5208         0
255         1    0  29      0      2   15.2458         0

In [57]:
from sklearn import svm
from sklearn.svm import SVC
clf=svm.SVC(gamma=0.01,C=100)

In [58]:
clf.fit(X_train,y_train)

SVC(C=100, break_ties=False, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma=0.01, kernel='rbf',
    max_iter=-1, probability=False, random_state=None, shrinking=True,
    tol=0.001, verbose=False)

In [59]:
y_pred=clf.predict(X_test)

In [61]:
accuracy_score(y_test,y_pred,normalize=True)

0.9029850746268657

In [60]:
confusion_matrix(y_test,y_pred)

array([[174,   7,   0,   0,   0,   0],
       [ 10,  54,   1,   0,   0,   0],
       [  0,   0,   5,   2,   0,   0],
       [  0,   2,   0,   4,   0,   0],
       [  0,   1,   2,   0,   4,   0],
       [  1,   0,   0,   0,   0,   1]], dtype=int64)

# Parch is DV
# Others are IDV

In [38]:
y=data['Parch']

In [39]:
X=data.drop(['Pclass','Name', 'PassengerId','Cabin','Ticket'],axis=1)

In [40]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.30,random_state=0)

In [41]:
X_train.head()

     Survived  Sex Age  SibSp  Parch     Fare  Embarked
857         1    1  51      0      0  26.5500         2
52          1    0  49      1      0  76.7292         0
386         0    1   1      5      2  46.9000         2
124         0    1  54      0      1  77.2875         2
578         0    0  18      1      0  14.4583         0

In [42]:
X_test.head()

     Survived  Sex Age  SibSp  Parch      Fare  Embarked
495         0    1  18      0      0   14.4583         0
648         0    1  18      0      0    7.5500         2
278         0    1   7      4      1   29.1250         1
31          1    0  18      1      0  146.5208         0
255         1    0  29      0      2   15.2458         0

In [43]:
from sklearn import svm
from sklearn.svm import SVC
clf=svm.SVC(gamma=0.01,C=100)

In [62]:
clf.fit(X_train,y_train)

SVC(C=100, break_ties=False, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma=0.01, kernel='rbf',
    max_iter=-1, probability=False, random_state=None, shrinking=True,
    tol=0.001, verbose=False)

In [63]:
y_pred=clf.predict(X_test)

In [45]:
accuracy_score(y_test,y_pred,normalize=True)

0.291044776119403

In [46]:
confusion_matrix(y_test,y_pred)

array([[ 58, 146,   0,   0,   0],
       [ 20,  20,   0,   0,   0],
       [ 16,   5,   0,   0,   0],
       [  2,   0,   0,   0,   0],
       [  1,   0,   0,   0,   0]], dtype=int64)

# SibSP is DV
# Others are IDV

In [48]:
y=data['SibSp']

In [49]:
X=data.drop(['Pclass','Name', 'PassengerId','Cabin','Ticket'],axis=1)

In [50]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.30,random_state=0)

In [51]:
X_train.head()

     Survived  Sex Age  SibSp  Parch     Fare  Embarked
857         1    1  51      0      0  26.5500         2
52          1    0  49      1      0  76.7292         0
386         0    1   1      5      2  46.9000         2
124         0    1  54      0      1  77.2875         2
578         0    0  18      1      0  14.4583         0

In [52]:
X_test.head()

     Survived  Sex Age  SibSp  Parch      Fare  Embarked
495         0    1  18      0      0   14.4583         0
648         0    1  18      0      0    7.5500         2
278         0    1   7      4      1   29.1250         1
31          1    0  18      1      0  146.5208         0
255         1    0  29      0      2   15.2458         0

In [53]:
from sklearn import svm
from sklearn.svm import SVC
clf=svm.SVC(gamma=0.01,C=100)

In [64]:
clf.fit(X_train,y_train)

SVC(C=100, break_ties=False, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma=0.01, kernel='rbf',
    max_iter=-1, probability=False, random_state=None, shrinking=True,
    tol=0.001, verbose=False)

In [65]:
y_pred=clf.predict(X_test)

In [55]:
accuracy_score(y_test,y_pred,normalize=True)

0.30223880597014924

In [66]:
confusion_matrix(y_test,y_pred)

array([[174,   7,   0,   0,   0,   0],
       [ 10,  54,   1,   0,   0,   0],
       [  0,   0,   5,   2,   0,   0],
       [  0,   2,   0,   4,   0,   0],
       [  0,   1,   2,   0,   4,   0],
       [  1,   0,   0,   0,   0,   1]], dtype=int64)

# Conclusion Survived, Gender  and Embarked have the higher accuracy score of 95% 94% and 90% respectively where as Parch and Sib have a lower score of 29% and 30% respectively.